tests/artillery_transfer.yml
config:
  target: http://node1.testnet.leapdao.org:8645
  phases:
    - duration: 60
      arrivalCount: 10
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "../helpers/helpers.js"
  payload:
    -
      path: "./out.csv"
      fields:
        - "from"
        - "privKey"
      order: sequence
      cast: false
      skipHeader: true
    -
      path: "./out.csv"
      fields:
        - "to"
      cast: false
      skipHeader: true
  variables:
    amount: 100
    color: 0
scenarios:
  - flow:
    - log: "From: {{ from }} to {{ to }}"
    - post:
        url: "/"
        body: "{\"method\":\"plasma_unspent\",\"params\":[\"{{ from }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$.result"
          as: "unspents"
    - log: "Unspents of {{ from }}: {{ unspents }}"
    - post:
        url: "/"
        body: "{\"method\":\"eth_getBalance\",\"params\":[\"{{ from }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "balance"
    - log: "Balance: {{ balance }}"
    - function: "makeTransfer"
    - log: "Transfer: {{ transfer}}"
    - log: "Transfer Hex: {{ transferHex }}"
    - post:
        url: "/"
        body: "{\"method\":\"eth_sendRawTransaction\",\"params\":[\"{{ transferHex }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "txResponse"
    - log: "Tx Response: {{ txResponse }}"
    - post:
        url: "/"
        body: "{\"method\":\"eth_getTransactionReceipt\",\"params\":[\"{{ txResponse.result }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "txData"
    - log: "Tx Data: {{ txData }}"