tests/artillery_transfer.yml
config:
  target: http://node1.testnet.leapdao.org:8645
  plugins:
    expect: {}
  phases:
    - duration: 1
      arrivalCount: 1
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "../helpers/helpers.js"
  payload:
    -
      path: "./out.csv"
      fields:
        - "from"
        - "privKey"
      order: sequence
      cast: false
      skipHeader: true
    -
      path: "./out.csv"
      fields:
        - "to"
      cast: false
      skipHeader: true
  variables:
    amount: 100
    color: 0
    startBlock: 45751
scenarios:
  - flow:
    - log: "From: {{ from }} to {{ to }}"
    - post:
        url: "/"
        body: "{\"method\":\"plasma_unspent\",\"params\":[\"{{ from }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$.result"
          as: "unspents"
    - log: "Unspents of {{ from }}: {{ unspents }}"
    - post:
        url: "/"
        body: "{\"method\":\"eth_getBalance\",\"params\":[\"{{ from }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "balance"
    - function: "makeTransfer"
    - post:
        url: "/"
        body: "{\"method\":\"eth_sendRawTransaction\",\"params\":[\"{{ transferHex }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "txResponse"
    - post:
        url: "/"
        body: "{\"method\":\"eth_getTransactionReceipt\",\"params\":[\"{{ txResponse.result }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "txData"
        expect:
          - hasProperty: 'result.blockNumber'
    - post:
        url: "/"
        body: "{\"method\":\"eth_getBlockByNumber\",\"params\":[\"{{ txData.result.blockNumber }}\",true],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "blockData"
    - function: "logResult"