tests/artillery_transfer.yml
config:
  target: https://testnet-node.leapdao.org/
  #target: http://18.218.2.145:8645
  plugins:
    expect: {}
  phases:
    - duration: 10
      arrivalRate: 50
      #arrivalCount: 1
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "../helpers/helpers.js"
  payload:
    -
      path: "./out.csv"
      fields:
        - "from"
        - "privKey"
      order: sequence
      cast: false
      skipHeader: true
    -
      path: "./out.csv"
      fields:
        - "to"
      cast: false
      skipHeader: true
  variables:
    amount: 100
    color: 0
    startBlock: 1910
    waitTime: 1
    receiptThreshold: 10
    noReceipt: false
scenarios:
  - flow:
    - log: "From: {{ from }} to {{ to }}"
    - post:
        url: "/"
        body: "{\"method\":\"plasma_unspent\",\"params\":[\"{{ from }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$.result"
          as: "unspents"
        expect:
          - hasProperty: 'result[0].outpoint'
    - post:
        url: "/"
        body: "{\"method\":\"eth_getBalance\",\"params\":[\"{{ from }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "balance"
    - function: "makeTransfer"
    - post:
        url: "/"
        body: "{\"method\":\"eth_sendRawTransaction\",\"params\":[\"{{ transferHex }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "txResponse"
        expect:
          - hasProperty: result
    - loop:
        - think: 1
        - post:
            url: "/"
            body: "{\"method\":\"eth_getTransactionReceipt\",\"params\":[\"{{ txResponse.result }}\"],\"id\":1,\"jsonrpc\":\"2.0\"}"
            capture:
              json: "$"
              as: "txData"
      whileTrue: "checkReceipt"
    - post:
        url: "/"
        ifTrue: "not noReceipt"
        body: "{\"method\":\"eth_getBlockByNumber\",\"params\":[\"{{ txData.result.blockNumber }}\",true],\"id\":1,\"jsonrpc\":\"2.0\"}"
        capture:
          json: "$"
          as: "blockData"
        expect:
          - hasProperty: result.transactions
    - function: "logResult"